arduino/ArduinoCore-mbed/libraries/ENVIE_Video_Firefly/EFM8UB2/SI_EFM8UB2_Defs.h
// Note: This header file is copied from
// C:\Keil_v5\C51\INC\SiLABS\EFM8UB2\inc or
// C:\SiliconLabs\SimplicityStudio\v3\developer\sdks\si8051\v3\Device\EFM8UB2\inc,
// and then more macros are added to facilitate firmware development.
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  EFM8UB20F32G_QFN32
//  EFM8UB20F32G_QFP32
//  EFM8UB20F32G_QFP48
//  EFM8UB20F64G_QFN32
//  EFM8UB20F64G_QFP32
//  EFM8UB20F64G_QFP48

#ifndef __SI_EFM8UB2_DEFS_H__
#define __SI_EFM8UB2_DEFS_H__

#include "si_toolchain.h"

//-----------------------------------------------------------------------------
// Register Definitions
//-----------------------------------------------------------------------------
SI_SFR (ACC,      0xE0); ///< Accumulator
SI_SFR (ADC0CF,   0xBC); ///< ADC0 Configuration
    #define ADC0CF_ADLJST   2 ///< ADC0 Left Justify Select
        #define RIGHT_JUSTIFIED 0
        #define LEFT_JUSTIFIED  1
    #define ADC0CF_ADSC     3 ///< SAR Clock Divider
SI_SFR (ADC0CN0,  0xE8); ///< ADC0 Control
    #define _ADC0CN0_ADCM    0 ///< Start of Conversion Mode Select
    #define _ADC0CN0_ADWINT  3 ///< Window Compare Interrupt Flag
    #define _ADC0CN0_ADBUSY  4 ///< ADC Busy
    #define _ADC0CN0_ADINT   5 ///< Conversion Complete Interrupt Flag
    #define _ADC0CN0_ADTM    6 ///< Track Mode
    #define _ADC0CN0_ADEN    7 ///< ADC Enable
SI_SFR (ADC0GTH,  0xC4); ///< ADC0 Greater-Than High Byte
SI_SFR (ADC0GTL,  0xC3); ///< ADC0 Greater-Than Low Byte
SI_SFR (ADC0H,    0xBE); ///< ADC0 Data Word High Byte
SI_SFR (ADC0L,    0xBD); ///< ADC0 Data Word Low Byte
SI_SFR (ADC0LTH,  0xC6); ///< ADC0 Less-Than High Byte
SI_SFR (ADC0LTL,  0xC5); ///< ADC0 Less-Than Low Byte
SI_SFR (AMX0N,    0xBA); ///< AMUX0 Negative Multiplexer Selection
    #define AMX0N_ADC0N0  0x00 ///< Select ADC0N.0
    #define AMX0N_ADC0N1  0x01 ///< Select ADC0N.1
    #define AMX0N_ADC0N2  0x02 ///< Select ADC0N.2
    #define AMX0N_ADC0N3  0x03 ///< Select ADC0N.3
    #define AMX0N_ADC0N4  0x04 ///< Select ADC0N.4
    #define AMX0N_ADC0N5  0x05 ///< Select ADC0N.5
    #define AMX0N_ADC0N6  0x06 ///< Select ADC0N.6
    #define AMX0N_ADC0N7  0x07 ///< Select ADC0N.7
    #define AMX0N_ADC0N8  0x08 ///< Select ADC0N.8
    #define AMX0N_ADC0N9  0x09 ///< Select ADC0N.9
    #define AMX0N_ADC0N10 0x0A ///< Select ADC0N.10
    #define AMX0N_ADC0N11 0x0B ///< Select ADC0N.11
    #define AMX0N_ADC0N12 0x0C ///< Select ADC0N.12
    #define AMX0N_ADC0N13 0x0D ///< Select ADC0N.13
    #define AMX0N_ADC0N14 0x0E ///< Select ADC0N.14
    #define AMX0N_ADC0N15 0x0F ///< Select ADC0N.15
    #define AMX0N_ADC0N16 0x10 ///< Select ADC0N.16
    #define AMX0N_ADC0N17 0x11 ///< Select ADC0N.17
    #define AMX0N_ADC0N18 0x12 ///< Select ADC0N.18
    #define AMX0N_ADC0N19 0x13 ///< Select ADC0N.19
    #define AMX0N_ADC0N20 0x14 ///< Select ADC0N.20
    #define AMX0N_ADC0N21 0x15 ///< Select ADC0N.21
    #define AMX0N_ADC0N22 0x16 ///< Select ADC0N.22
    #define AMX0N_ADC0N23 0x17 ///< Select ADC0N.23
    #define AMX0N_ADC0N24 0x18 ///< Select ADC0N.24
    #define AMX0N_ADC0N25 0x19 ///< Select ADC0N.25
    #define AMX0N_ADC0N26 0x1A ///< Select ADC0N.26
    #define AMX0N_ADC0N27 0x1B ///< Select ADC0N.27
    #define AMX0N_ADC0N28 0x1C ///< Select ADC0N.28
    #define AMX0N_ADC0N29 0x1D ///< Select ADC0N.29
    #define AMX0N_VREF    0x1E ///< Internal Voltage Reference
    #define AMX0N_GND     0x1F ///< Ground (single-ended mode)
    #define AMX0N_ADC0N32 0x20 ///< Select ADC0N.32
    #define AMX0N_ADC0N33 0x21 ///< Select ADC0N.33
    #define AMX0N_ADC0N34 0x22 ///< Select ADC0N.34
SI_SFR (AMX0P,    0xBB); ///< AMUX0 Positive Multiplexer Selection
    #define AMX0P_ADC0P0  0x00 ///< Select ADC0P.0
    #define AMX0P_ADC0P1  0x01 ///< Select ADC0P.1
    #define AMX0P_ADC0P2  0x02 ///< Select ADC0P.2
    #define AMX0P_ADC0P3  0x03 ///< Select ADC0P.3
    #define AMX0P_ADC0P4  0x04 ///< Select ADC0P.4
    #define AMX0P_ADC0P5  0x05 ///< Select ADC0P.5
    #define AMX0P_ADC0P6  0x06 ///< Select ADC0P.6
    #define AMX0P_ADC0P7  0x07 ///< Select ADC0P.7
    #define AMX0P_ADC0P8  0x08 ///< Select ADC0P.8
    #define AMX0P_ADC0P9  0x09 ///< Select ADC0P.9
    #define AMX0P_ADC0P10 0x0A ///< Select ADC0P.10
    #define AMX0P_ADC0P11 0x0B ///< Select ADC0P.11
    #define AMX0P_ADC0P12 0x0C ///< Select ADC0P.12
    #define AMX0P_ADC0P13 0x0D ///< Select ADC0P.13
    #define AMX0P_ADC0P14 0x0E ///< Select ADC0P.14
    #define AMX0P_ADC0P15 0x0F ///< Select ADC0P.15
    #define AMX0P_ADC0P16 0x10 ///< Select ADC0P.16
    #define AMX0P_ADC0P17 0x11 ///< Select ADC0P.17
    #define AMX0P_ADC0P18 0x12 ///< Select ADC0P.18
    #define AMX0P_ADC0P19 0x13 ///< Select ADC0P.19
    #define AMX0P_ADC0P20 0x14 ///< Select ADC0P.20
    #define AMX0P_ADC0P21 0x15 ///< Select ADC0P.21
    #define AMX0P_ADC0P22 0x16 ///< Select ADC0P.22
    #define AMX0P_ADC0P23 0x17 ///< Select ADC0P.23
    #define AMX0P_ADC0P24 0x18 ///< Select ADC0P.24
    #define AMX0P_ADC0P25 0x19 ///< Select ADC0P.25
    #define AMX0P_ADC0P26 0x1A ///< Select ADC0P.26
    #define AMX0P_ADC0P27 0x1B ///< Select ADC0P.27
    #define AMX0P_ADC0P28 0x1C ///< Select ADC0P.28
    #define AMX0P_ADC0P29 0x1D ///< Select ADC0P.29
    #define AMX0P_TEMP    0x1E ///< Temperature sensor
    #define AMX0P_VDD     0x1F ///< VDD Supply Voltage
    #define AMX0P_ADC0P32 0x20 ///< Select ADC0P.32
    #define AMX0P_ADC0P33 0x21 ///< Select ADC0P.33
    #define AMX0P_ADC0P34 0x22 ///< Select ADC0P.34
SI_SFR (B,        0xF0); ///< B Register
SI_SFR (CKCON0,   0x8E); ///< Clock Control 0
    #define CKCON0_SCA  0 ///< Timer 0/1 Prescale
        #define SYSCLK_DIV_12   0 ///< System clock divided by 12
        #define SYSCLK_DIV_4    1 ///< System clock divided by 4
        #define SYSCLK_DIV_48   2 ///< System clock divided by 48
        #define EXTOSC_DIV_8    3 ///< External oscillator divided by 8 (synchronized with the system clock)
    #define CKCON0_T0M  2 ///< Timer 0 Clock Select
        #define T0M_PRESCALE 0   ///< Timer 0 uses the clock defined by the prescale field, SCA.
        #define T0M_SYSCLK   1   ///< Timer 0 uses the system clock
    #define CKCON0_T1M  3 ///< Timer 1 Clock Select
        #define T1M_PRESCALE 0   ///< Timer 1 uses the clock defined by the prescale field, SCA.
        #define T1M_SYSCLK   1   ///< Timer 1 uses the system clock
    #define CKCON0_T2ML 4 ///< Timer 2 Low Byte Clock Select
        #define T2ML_EXTERNAL_CLOCK 0 ///< Timer 2 low byte uses the clock defined by T2XCLK in TMR2CN0
        #define T2ML_SYSCLK         1 ///< Timer 2 low byte uses the system clock.
    #define CKCON0_T3ML 6 ///< Timer 3 Low Byte Clock Select
        #define T3ML_EXTERNAL_CLOCK 0 ///< Timer 3 low byte uses the clock defined by T2XCLK in TMR2CN0
        #define T3ML_SYSCLK         1 ///< Timer 3 low byte uses the system clock.
SI_SFR (CKCON1,   0xE4); ///< Clock Control 1
SI_SFR (CLKSEL,   0xA9); ///< Clock Select
    #define CLKSEL_CLKSL    0 ///< System Clock Source Select Bits
        #define DIVIDED_HFOSC_DIV_4 0 ///< Clock (SYSCLK) derived from the Internal High-Frequency Oscillator / 4 and scaled per the IFCN bits in register HFO0CN
        #define EXTOSC              1 ///< Clock (SYSCLK) derived from the External Oscillator circuit
        #define HFOSC_DIV_2         2 ///< Clock (SYSCLK) derived from the Internal High-Frequency Oscillator / 2
        #define HFOSC               3 ///< Clock (SYSCLK) derived from the Internal High-Frequency Oscillator
        #define LFOSC               4 ///< Clock (SYSCLK) derived from the Internal Low-Frequency Oscillator and scaled per the OSCLD bits in register OSCLCN.
SI_SFR (CMP0CN0,  0x9B); ///< Comparator 0 Control 0
SI_SFR (CMP0MD,   0x9D); ///< Comparator 0 Mode
SI_SFR (CMP0MX,   0x9F); ///< Comparator 0 Multiplexer Selection
SI_SFR (CMP1CN0,  0x9A); ///< Comparator 1 Control 0
SI_SFR (CMP1MD,   0x9C); ///< Comparator 1 Mode
SI_SFR (CMP1MX,   0x9E); ///< Comparator 1 Multiplexer Selection
SI_SFR (DPH,      0x83); ///< Data Pointer High
SI_SFR (DPL,      0x82); ///< Data Pointer Low
SI_SFR (EIE1,     0xE6); ///< Extended Interrupt Enable 1
SI_SFR (EIE2,     0xE7); ///< Extended Interrupt Enable 2
SI_SFR (EIP1,     0xF6); ///< Extended Interrupt Priority 1
SI_SFR (EIP2,     0xF7); ///< Extended Interrupt Priority 2
SI_SFR (EMI0CF,   0x85); ///< External Memory Configuration
SI_SFR (EMI0CN,   0xAA); ///< External Memory Interface Control
SI_SFR (EMI0TC,   0x84); ///< External Memory Timing Control
SI_SFR (FLKEY,    0xB7); ///< Flash Lock and Key
SI_SFR (FLSCL,    0xB6); ///< Flash Scale
    #define FLSCL_FLRT  4
        #define SYSCLK_BELOW_25_MHZ 0
        #define SYSCLK_BELOW_48_MHZ 1
SI_SFR (HFO0CAL,  0xB3); ///< High Frequency Oscillator Calibration
SI_SFR (HFO0CN,   0xB2); ///< High Frequency Oscillator Control
    #define HFO0CN_IFCN 0 ///< Oscillator Frequency Divider Control
        #define SYSCLK_DIV_8 0 ///< SYSCLK can be derived from Internal H-F Oscillator divided by 8 (1.5 MHz)
        #define SYSCLK_DIV_4 1 ///< SYSCLK can be derived from Internal H-F Oscillator divided by 4 (3 MHz)
        #define SYSCLK_DIV_2 2 ///< SYSCLK can be derived from Internal H-F Oscillator divided by 2 (6 MHz)
        #define SYSCLK_DIV_1 3 ///< SYSCLK can be derived from Internal H-F Oscillator divided by 1 (12 MHz).
SI_SFR (IE,       0xA8); ///< Interrupt Enable
SI_SFR (IP,       0xB8); ///< Interrupt Priority
SI_SFR (IT01CF,   0xE4); ///< INT0/INT1 Configuration
    #define IT01CF_IN0SL    0
        #define IN0SL_P0_0  0
        #define IN0SL_P0_1  1
        #define IN0SL_P0_2  2
        #define IN0SL_P0_3  3
        #define IN0SL_P0_4  4
        #define IN0SL_P0_5  5
        #define IN0SL_P0_6  6
        #define IN0SL_P0_7  7
    #define IT01CF_IN0PL    3
        #define IN0PL_ACTIVE_LOW    0
        #define IN0PL_ACTIVE_HIGH   1
    #define IT01CF_IN1SL    4
        #define IN1SL_P0_0  0
        #define IN1SL_P0_1  1
        #define IN1SL_P0_2  2
        #define IN1SL_P0_3  3
        #define IN1SL_P0_4  4
        #define IN1SL_P0_5  5
        #define IN1SL_P0_6  6
        #define IN1SL_P0_7  7
    #define IT01CF_IN1PL    7
        #define IN1PL_ACTIVE_LOW    0
        #define IN1PL_ACTIVE_HIGH   1
SI_SFR (LFO0CN,   0x86); ///< Low Frequency Oscillator Control
SI_SFR (P0,       0x80); ///< Port 0 Pin Latch
SI_SFR (P0MDIN,   0xF1); ///< Port 0 Input Mode
    #define P0MDIN_B0   0
        #define ANALOG  0
        #define DIGITAL 1
    #define P0MDIN_B1   1
    #define P0MDIN_B2   2
    #define P0MDIN_B3   3
    #define P0MDIN_B4   4
    #define P0MDIN_B5   5
    #define P0MDIN_B6   6
    #define P0MDIN_B7   7
SI_SFR (P0MDOUT,  0xA4); ///< Port 0 Output Mode
    #define P0MDOUT_B0  0
        #define OPEN_DRAIN  0
        #define PUSH_PULL   1
    #define P0MDOUT_B1  1
    #define P0MDOUT_B2  2
    #define P0MDOUT_B3  3
    #define P0MDOUT_B4  4
    #define P0MDOUT_B5  5
    #define P0MDOUT_B6  6
    #define P0MDOUT_B7  7
SI_SFR (P0SKIP,   0xD4); ///< Port 0 Skip
    #define P0SKIP_B0   0
        #define NOT_SKIPPED 0
        #define SKIPPED     1
    #define P0SKIP_B1   1
    #define P0SKIP_B2   2
    #define P0SKIP_B3   3
    #define P0SKIP_B4   4
    #define P0SKIP_B5   5
    #define P0SKIP_B6   6
    #define P0SKIP_B7   7
SI_SFR (P1,       0x90); ///< Port 1 Pin Latch
SI_SFR (P1MDIN,   0xF2); ///< Port 1 Input Mode
    #define P1MDIN_B0   0
    #define P1MDIN_B1   1
    #define P1MDIN_B2   2
    #define P1MDIN_B3   3
    #define P1MDIN_B4   4
    #define P1MDIN_B5   5
    #define P1MDIN_B6   6
    #define P1MDIN_B7   7
SI_SFR (P1MDOUT,  0xA5); ///< Port 1 Output Mode
    #define P1MDOUT_B0  0
    #define P1MDOUT_B1  1
    #define P1MDOUT_B2  2
    #define P1MDOUT_B3  3
    #define P1MDOUT_B4  4
    #define P1MDOUT_B5  5
    #define P1MDOUT_B6  6
    #define P1MDOUT_B7  7
SI_SFR (P1SKIP,   0xD5); ///< Port 1 Skip
    #define P1SKIP_B0   0
    #define P1SKIP_B1   1
    #define P1SKIP_B2   2
    #define P1SKIP_B3   3
    #define P1SKIP_B4   4
    #define P1SKIP_B5   5
    #define P1SKIP_B6   6
    #define P1SKIP_B7   7
SI_SFR (P2,       0xA0); ///< Port 2 Pin Latch
SI_SFR (P2MDIN,   0xF3); ///< Port 2 Input Mode
    #define P2MDIN_B0   0
    #define P2MDIN_B1   1
    #define P2MDIN_B2   2
    #define P2MDIN_B3   3
    #define P2MDIN_B4   4
    #define P2MDIN_B5   5
    #define P2MDIN_B6   6
    #define P2MDIN_B7   7
SI_SFR (P2MDOUT,  0xA6); ///< Port 2 Output Mode
    #define P2MDOUT_B0  0
    #define P2MDOUT_B1  1
    #define P2MDOUT_B2  2
    #define P2MDOUT_B3  3
    #define P2MDOUT_B4  4
    #define P2MDOUT_B5  5
    #define P2MDOUT_B6  6
    #define P2MDOUT_B7  7
SI_SFR (P2SKIP,   0xD6); ///< Port 2 Skip
    #define P2SKIP_B0   0
    #define P2SKIP_B1   1
    #define P2SKIP_B2   2
    #define P2SKIP_B3   3
    #define P2SKIP_B4   4
    #define P2SKIP_B5   5
    #define P2SKIP_B6   6
    #define P2SKIP_B7   7
SI_SFR (P3,       0xB0); ///< Port 3 Pin Latch
SI_SFR (P3MDIN,   0xF4); ///< Port 3 Input Mode
    #define P3MDIN_B0   0
    #define P3MDIN_B1   1
    #define P3MDIN_B2   2
    #define P3MDIN_B3   3
    #define P3MDIN_B4   4
    #define P3MDIN_B5   5
    #define P3MDIN_B6   6
    #define P3MDIN_B7   7
SI_SFR (P3MDOUT,  0xA7); ///< Port 3 Output Mode
    #define P3MDOUT_B0  0
    #define P3MDOUT_B1  1
    #define P3MDOUT_B2  2
    #define P3MDOUT_B3  3
    #define P3MDOUT_B4  4
    #define P3MDOUT_B5  5
    #define P3MDOUT_B6  6
    #define P3MDOUT_B7  7
SI_SFR (P3SKIP,   0xDF); ///< Port 3 Skip
    #define P3SKIP_B0   0
    #define P3SKIP_B1   1
    #define P3SKIP_B2   2
    #define P3SKIP_B3   3
    #define P3SKIP_B4   4
    #define P3SKIP_B5   5
    #define P3SKIP_B6   6
    #define P3SKIP_B7   7
SI_SFR (P4,       0xC7); ///< Port 4 Pin Latch
SI_SFR (P4MDIN,   0xF5); ///< Port 4 Input Mode
SI_SFR (P4MDOUT,  0xAE); ///< Port 4 Output Mode
SI_SFR (PCA0CN0,  0xD8); ///< PCA Control 0

SI_SFR (PCA0CPH0, 0xFC); ///< PCA Channel 0 Capture Module High Byte
SI_SFR (PCA0CPH1, 0xEA); ///< PCA Channel 1 Capture Module High Byte
SI_SFR (PCA0CPH2, 0xEC); ///< PCA Channel 2 Capture Module High Byte
SI_SFR (PCA0CPH3, 0xEE); ///< PCA Channel 3 Capture Module High Byte
SI_SFR (PCA0CPH4, 0xFE); ///< PCA Channel 4 Capture Module High Byte
SI_SFR (PCA0CPL0, 0xFB); ///< PCA Channel 0 Capture Module Low Byte
SI_SFR (PCA0CPL1, 0xE9); ///< PCA Channel 1 Capture Module Low Byte
SI_SFR (PCA0CPL2, 0xEB); ///< PCA Channel 2 Capture Module Low Byte
SI_SFR (PCA0CPL3, 0xED); ///< PCA Channel 3 Capture Module Low Byte
SI_SFR (PCA0CPL4, 0xFD); ///< PCA Channel 4 Capture Module Low Byte
SI_SFR (PCA0CPM0, 0xDA); ///< PCA Channel 0 Capture/Compare Mode
    #define PCA0CPM_ECCF    0 ///< Capture/Compare Flag Interrupt Enable
    #define PCA0CPM_PWM     1 ///< Pulse Width Modulation Mode Enable
    #define PCA0CPM_TOG     2 ///< Toggle Function Enable
    #define PCA0CPM_MAT     3 ///< Match Function Enable
    #define PCA0CPM_CAPN    4 ///< Capture Negative Function Enable
    #define PCA0CPM_CAPP    5 ///< Capture Positive Function Enable
    #define PCA0CPM_ECOM    6 ///< Comparator Function Enable
    #define PCA0CPM_PWM16   7 ///< 16-bit Pulse Width Modulation Enable
SI_SFR (PCA0CPM1, 0xDB); ///< PCA Channel 1 Capture/Compare Mode
SI_SFR (PCA0CPM2, 0xDC); ///< PCA Channel 2 Capture/Compare Mode
SI_SFR (PCA0CPM3, 0xDD); ///< PCA Channel 3 Capture/Compare Mode
SI_SFR (PCA0CPM4, 0xDE); ///< PCA Channel 4 Capture/Compare Mode
SI_SFR (PCA0H,    0xFA); ///< PCA Counter/Timer High Byte
SI_SFR (PCA0L,    0xF9); ///< PCA Counter/Timer Low Byte
SI_SFR (PCA0MD,   0xD9); ///< PCA Mode
    #define PCA0MD_ECF      0 //< PCA Counter/Timer Overflow Interrupt Enable
    #define PCA0MD_CPS      1 ///< PCA Counter/Timer Pulse Select
    #define PCA0MD_CPS_SYSCLK_DIV_12    0

