arduino/ArduinoCore-mbed/libraries/ENVIE_Video_Firefly/EFM8UB2/SI_EFM8UB2_Defs.h
    #define PCA0MD_WDLCK    5 ///< Watchdog Timer Lock
    #define PCA0MD_WDTE     6 ///< Watchdog Timer Enable
    #define PCA0MD_CIDL     7 ///< PCA Counter/Timer Idle Control
SI_SFR (PCON0,    0x87); ///< Power Control
SI_SFR (PFE0CN,   0xAF); ///< Prefetch Engine Control
SI_SFR (PSCTL,    0x8F); ///< Program Store Control
SI_SFR (PSW,      0xD0); ///< Program Status Word
SI_SFR (REF0CN,   0xD1); ///< Voltage Reference Control
    #define REF0CN_REFBE    0 ///< Internal Reference Buffer Enable
    #define REF0CN_TEMPE    2 ///< Temperature Sensor Enable
    #define REF0CN_REFSL    3 ///< Voltage Reference Select
    #define REF0CN_REGOVR   4 ///< Regulator Reference Override
    #define REF0CN_REFBGS   7 ///< Reference Buffer Gain Select
SI_SFR (REG01CN,  0xC9); ///< Voltage Regulator Control
SI_SFR (RSTSRC,   0xEF); ///< Reset Source
    #define RSTSRC_PORSF    1 ///< Power-On / Supply Monitor Reset Flag, and Supply Monitor Reset Enable
    #define RSTSRC_MCDRSF   2 ///< Missing Clock Detector Enable and Flag
    #define RSTSRC_SWRSF    4 ///< Software Reset Force and Flag
SI_SFR (SBCON1,   0xAC); ///< UART1 Baud Rate Generator Control
SI_SFR (SBRLH1,   0xB5); ///< UART1 Baud Rate Generator High Byte
SI_SFR (SBRLL1,   0xB4); ///< UART1 Baud Rate Generator Low Byte
SI_SFR (SBUF0,    0x99); ///< UART0 Serial Port Data Buffer
SI_SFR (SBUF1,    0xD3); ///< UART1 Serial Port Data Buffer
SI_SFR (SCON0,    0x98); ///< UART0 Serial Port Control
    #define _SCON0_REN   4 ///< Receive Enable
    #define _SCON0_SMODE 7 ///< Serial Port 0 Operation Mode
        #define SMODE_8_BIT 0 ///< 8-bit UART with Variable Baud Rate (Mode 0).
        #define SMODE_9_BIT 1 ///< 9-bit UART with Variable Baud Rate (Mode 1).
SI_SFR (SCON1,    0xD2); ///< UART1 Serial Port Control
SI_SFR (SFRPAGE,  0xBF); ///< SFR Page
SI_SFR (SMB0ADM,  0xCE); ///< SMBus 0 Slave Address Mask
SI_SFR (SMB0ADR,  0xCF); ///< SMBus 0 Slave Address
SI_SFR (SMB0CF,   0xC1); ///< SMBus 0 Configuration
    #define SMB0CF_SMBCS    0 ///< SMBus Clock Source Selection
        #define SMBCS_TIMER0        0 ///< Timer 0 Overflow.
        #define SMBCS_TIMER1        1 ///< Timer 1 Overflow.
        #define SMBCS_TIMER2_HIGH   2 ///< Timer 2 High Byte Overflow
        #define SMBCS_TIMER2_LOW    3 ///< Timer 2 Low Byte Overflow.
    #define SMB0CF_EXTHOLD  4 ///< SMBus Setup and Hold Time Extension Enable
    #define SMB0CF_INH      6 ///< SMBus Slave Inhibit
    #define SMB0CF_ENSMB    7 ///< SMBus Enable
SI_SFR (SMB0CN0,  0xC0); ///< SMBus 0 Control
SI_SFR (SMB0DAT,  0xC2); ///< SMBus 0 Data
SI_SFR (SMB1ADM,  0xCE); ///< SMBus 1 Slave Address Mask
SI_SFR (SMB1ADR,  0xCF); ///< SMBus 1 Slave Address
SI_SFR (SMB1CF,   0xC1); ///< SMBus 1 Configuration
SI_SFR (SMB1CN0,  0xC0); ///< SMBus 1 Control
SI_SFR (SMB1DAT,  0xC2); ///< SMBus 1 Data
SI_SFR (SMBTC,    0xB9); ///< SMBus Timing and Pin Control
SI_SFR (SMOD1,    0xE5); ///< UART1 Mode
SI_SFR (SP,       0x81); ///< Stack Pointer
SI_SFR (SPI0CFG,  0xA1); ///< SPI0 Configuration
SI_SFR (SPI0CKR,  0xA2); ///< SPI0 Clock Rate
SI_SFR (SPI0CN0,  0xF8); ///< SPI0 Control
SI_SFR (SPI0DAT,  0xA3); ///< SPI0 Data
SI_SFR (TCON,     0x88); ///< Timer 0/1 Control
SI_SFR (TH0,      0x8C); ///< Timer 0 High Byte
SI_SFR (TH1,      0x8D); ///< Timer 1 High Byte
SI_SFR (TL0,      0x8A); ///< Timer 0 Low Byte
SI_SFR (TL1,      0x8B); ///< Timer 1 Low Byte
SI_SFR (TMOD,     0x89); ///< Timer 0/1 Mode
    #define TMOD_T0M    0 ///< Timer 0 Mode Select
        #define T0M_MODE0   0 ///< Mode 0, 13-bit Counter/Timer
        #define T0M_MODE1   1 ///< Mode 1, 16-bit Counter/Timer
        #define T0M_MODE2   2 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload
        #define T0M_MODE3   3 ///< Mode 3, Two 8-bit Counter/Timers
    #define TMOD_T1M    4 ///< Timer 1 Mode Select
        #define T1M_MODE0   0 ///< Mode 0, 13-bit Counter/Timer
        #define T1M_MODE1   1 ///< Mode 1, 16-bit Counter/Timer
        #define T1M_MODE2   2 ///< Mode 2, 8-bit Counter/Timer with Auto-Reload
        #define T1M_MODE3   3 ///< Mode 3, Two 8-bit Counter/Timers
SI_SFR (TMR2CN0,  0xC8); ///< Timer 2 Control 0
    #define TMR2CN_T2SOF    4
    #define TMR2CN_T2SPLIT  3
    #define TMR2CN_TR2      2
    #define TMR2CN_T2XCLK   0
        #define T2XCLK_SYSCLK_DIV_12    0 ///< Timer 2 clock is the system clock divided by 12
        #define T2XCLK_EXTOSC_DIV_8     1 ///< Timer 2 clock is the external oscillator divided
SI_SFR (TMR2H,    0xCD); ///< Timer 2 High Byte
SI_SFR (TMR2L,    0xCC); ///< Timer 2 Low Byte
SI_SFR (TMR2RLH,  0xCB); ///< Timer 2 Reload High Byte
SI_SFR (TMR2RLL,  0xCA); ///< Timer 2 Reload Low Byte
SI_SFR (TMR3CN0,  0x91); ///< Timer 3 Control 0
    #define TMR3CN_TF3H     7 ///< Timer 3 High Byte Overflow Flag
    #define TMR3CN_T3SOF    4
    #define TMR3CN_T3SPLIT  3
    #define TMR3CN_TR3      2 ///< Timer 3 Run Control
    #define TMR3CN_T3XCLK   0
        #define T3XCLK_SYSCLK_DIV_12    0 ///< Timer 3 clock is the system clock divided by 12
        #define T3XCLK_EXTOSC_DIV_8     1 ///< Timer 3 clock is the external oscillator divided
SI_SFR (TMR3H,    0x95); ///< Timer 3 High Byte
SI_SFR (TMR3L,    0x94); ///< Timer 3 Low Byte
SI_SFR (TMR3RLH,  0x93); ///< Timer 3 Reload High Byte
SI_SFR (TMR3RLL,  0x92); ///< Timer 3 Reload Low Byte
SI_SFR (TMR4CN0,  0x91); ///< Timer 4 Control 0
SI_SFR (TMR4H,    0x95); ///< Timer 4 High Byte
SI_SFR (TMR4L,    0x94); ///< Timer 4 Low Byte
SI_SFR (TMR4RLH,  0x93); ///< Timer 4 Reload High Byte
SI_SFR (TMR4RLL,  0x92); ///< Timer 4 Reload Low Byte
SI_SFR (TMR5CN0,  0xC8); ///< Timer 5 Control 0
SI_SFR (TMR5H,    0xCD); ///< Timer 5 High Byte
SI_SFR (TMR5L,    0xCC); ///< Timer 5 Low Byte
SI_SFR (TMR5RLH,  0xCB); ///< Timer 5 Reload High Byte
SI_SFR (TMR5RLL,  0xCA); ///< Timer 5 Reload Low Byte
SI_SFR (USB0ADR,  0x96); ///< USB0 Indirect Address
SI_SFR (USB0DAT,  0x97); ///< USB0 Data
SI_SFR (USB0XCN,  0xD7); ///< USB0 Transceiver Control
SI_SFR (VDM0CN,   0xFF); ///< Supply Monitor Control
    #define VDM0CN_VDMEN    7 ///< Supply Monitor Enable
    #define VDM0CN_VDDSTAT  6 ///< Read Only, Supply Status
SI_SFR (XBR0,     0xE1); ///< Port I/O Crossbar 0
    #define XBR0_URT0E  0 ///< UART0 I/O Output Enable
    #define XBR0_SMB0E  2 ///< SMB0 I/O Enable
    #define XBR0_SYSCKE 3 ///< SYSCLK Output Enable
SI_SFR (XBR1,     0xE2); ///< Port I/O Crossbar 1
    #define XBR1_XBARE      6 ///< Crossbar Enable
    #define XBR1_WEAKPUD    7 ///< Port I/O Weak Pullup Disable
SI_SFR (XBR2,     0xE3); ///< Port I/O Crossbar 2
SI_SFR (XOSC0CN,  0xB1); ///< External Oscillator Control

//------------------------------------------------------------------------------
// 16-bit Register Definitions (may not work on all compilers)
//------------------------------------------------------------------------------
SI_SFR16 (ADC0GT,  0xC3); ///< ADC0 Greater-Than
SI_SFR16 (ADC0,    0xBD); ///< ADC0 Data Word
SI_SFR16 (ADC0LT,  0xC5); ///< ADC0 Less-Than
SI_SFR16 (DP,      0x82); ///< Data Pointer
SI_SFR16 (PCA0CP0, 0xFB); ///< PCA Channel 0 Capture Module
SI_SFR16 (PCA0CP1, 0xE9); ///< PCA Channel 1 Capture Module
SI_SFR16 (PCA0CP2, 0xEB); ///< PCA Channel 2 Capture Module
SI_SFR16 (PCA0CP3, 0xED); ///< PCA Channel 3 Capture Module
SI_SFR16 (PCA0CP4, 0xFD); ///< PCA Channel 4 Capture Module
SI_SFR16 (PCA0,    0xF9); ///< PCA Counter/Timer
SI_SFR16 (SBRL1,   0xB4); ///< UART1 Baud Rate Generator
SI_SFR16 (TMR2,    0xCC); ///< Timer 2
SI_SFR16 (TMR2RL,  0xCA); ///< Timer 2 Reload
SI_SFR16 (TMR3,    0x94); ///< Timer 3
SI_SFR16 (TMR3RL,  0x92); ///< Timer 3 Reload
SI_SFR16 (TMR4,    0x94); ///< Timer 4
SI_SFR16 (TMR4RL,  0x92); ///< Timer 4 Reload
SI_SFR16 (TMR5,    0xCC); ///< Timer 5
SI_SFR16 (TMR5RL,  0xCA); ///< Timer 5 Reload

//------------------------------------------------------------------------------
// Indirect Register Definitions
//------------------------------------------------------------------------------
#define CLKREC   0x0F ///< USB0 Clock Recovery Control
#define CMIE     0x0B ///< USB0 Common Interrupt Enable
#define CMINT    0x06 ///< USB0 Common Interrupt
#define E0CNT    0x16 ///< USB0 Endpoint0 Data Count
#define E0CSR    0x11 ///< USB0 Endpoint0 Control
#define EENABLE  0x1E ///< USB0 Endpoint Enable
#define EINCSRH  0x12 ///< USB0 IN Endpoint Control High
#define EINCSRL  0x11 ///< USB0 IN Endpoint Control
#define EOUTCNTH 0x17 ///< USB0 OUT Endpoint Count High
#define EOUTCNTL 0x16 ///< USB0 OUT Endpoint Count
#define EOUTCSRH 0x15 ///< USB0 OUT Endpoint Control High
#define EOUTCSRL 0x14 ///< USB0 OUT Endpoint Control
#define FADDR    0x00 ///< USB0 Function Address
#define FIFO0    0x20 ///< USB0 Endpoint 0 FIFO Access
#define FIFO1    0x21 ///< USB0 Endpoint 1 FIFO Access
#define FIFO2    0x22 ///< USB0 Endpoint 2 FIFO Access
#define FIFO3    0x23 ///< USB0 Endpoint 3 FIFO Access
#define FRAMEH   0x0D ///< USB0 Frame Number High
#define FRAMEL   0x0C ///< USB0 Frame Number
#define IN1IE    0x07 ///< USB0 IN Endpoint Interrupt Enable
#define IN1INT   0x02 ///< USB0 IN Endpoint Interrupt
#define INDEX    0x0E ///< USB0 Endpoint Index
#define OUT1IE   0x09 ///< USB0 OUT Endpoint Interrupt Enable
#define OUT1INT  0x04 ///< USB0 OUT Endpoint Interrupt
#define POWER    0x01 ///< USB0 Power

//------------------------------------------------------------------------------
// Bit Definitions
//------------------------------------------------------------------------------

// ACC (Accumulator)
#define SFR_ACC 0xE0
SI_SBIT (ACC_ACC0, SFR_ACC, 0); ///< Accumulator Bit 0
SI_SBIT (ACC_ACC1, SFR_ACC, 1); ///< Accumulator Bit 1
SI_SBIT (ACC_ACC2, SFR_ACC, 2); ///< Accumulator Bit 2
SI_SBIT (ACC_ACC3, SFR_ACC, 3); ///< Accumulator Bit 3
SI_SBIT (ACC_ACC4, SFR_ACC, 4); ///< Accumulator Bit 4
SI_SBIT (ACC_ACC5, SFR_ACC, 5); ///< Accumulator Bit 5
SI_SBIT (ACC_ACC6, SFR_ACC, 6); ///< Accumulator Bit 6
SI_SBIT (ACC_ACC7, SFR_ACC, 7); ///< Accumulator Bit 7

// ADC0CN0 (ADC0 Control)
#define SFR_ADC0CN0 0xE8
SI_SBIT (ADC0CN0_ADCM0,  SFR_ADC0CN0, 0); ///< Start of Conversion Mode Select Bit 0
SI_SBIT (ADC0CN0_ADCM1,  SFR_ADC0CN0, 1); ///< Start of Conversion Mode Select Bit 1
SI_SBIT (ADC0CN0_ADCM2,  SFR_ADC0CN0, 2); ///< Start of Conversion Mode Select Bit 2
SI_SBIT (ADC0CN0_ADWINT, SFR_ADC0CN0, 3); ///< Window Compare Interrupt Flag
SI_SBIT (ADC0CN0_ADBUSY, SFR_ADC0CN0, 4); ///< ADC Busy
SI_SBIT (ADC0CN0_ADINT,  SFR_ADC0CN0, 5); ///< Conversion Complete Interrupt Flag
SI_SBIT (ADC0CN0_ADTM,   SFR_ADC0CN0, 6); ///< Track Mode
SI_SBIT (ADC0CN0_ADEN,   SFR_ADC0CN0, 7); ///< ADC Enable

// B (B Register)
#define SFR_B 0xF0
SI_SBIT (B_B0, SFR_B, 0); ///< B Register Bit 0
SI_SBIT (B_B1, SFR_B, 1); ///< B Register Bit 1
SI_SBIT (B_B2, SFR_B, 2); ///< B Register Bit 2
SI_SBIT (B_B3, SFR_B, 3); ///< B Register Bit 3
SI_SBIT (B_B4, SFR_B, 4); ///< B Register Bit 4
SI_SBIT (B_B5, SFR_B, 5); ///< B Register Bit 5
SI_SBIT (B_B6, SFR_B, 6); ///< B Register Bit 6
SI_SBIT (B_B7, SFR_B, 7); ///< B Register Bit 7

// IE (Interrupt Enable)
#define SFR_IE 0xA8
SI_SBIT (IE_EX0,   SFR_IE, 0); ///< External Interrupt 0 Enable
SI_SBIT (IE_ET0,   SFR_IE, 1); ///< Timer 0 Interrupt Enable
SI_SBIT (IE_EX1,   SFR_IE, 2); ///< External Interrupt 1 Enable
SI_SBIT (IE_ET1,   SFR_IE, 3); ///< Timer 1 Interrupt Enable
SI_SBIT (IE_ES0,   SFR_IE, 4); ///< UART0 Interrupt Enable
SI_SBIT (IE_ET2,   SFR_IE, 5); ///< Timer 2 Interrupt Enable
SI_SBIT (IE_ESPI0, SFR_IE, 6); ///< SPI0 Interrupt Enable
SI_SBIT (IE_EA,    SFR_IE, 7); ///< All Interrupts Enable

